### Importing the Packages

In [1]:
import pandas as pd
import numpy as np

### Importing the data

In [2]:
raw_csv_data = pd.read_csv("Index2018.csv") 
df_comp = raw_csv_data.copy()

In [3]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

### Lenght of the Time Period

In [4]:
len(df_comp.date)

6269

In [5]:
df_comp.date.describe()

count           6269
unique          6269
top       02/03/2006
freq               1
Name: date, dtype: object

### From Text to Date

In [6]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst= True)

In [7]:
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [8]:
df_comp.date.describe() # datetime_is_numeric=True

<ipython-input-8-1f4b555edcf3>:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df_comp.date.describe() # datetime_is_numeric=True

count                    6269
unique                   6269
top       1999-11-12 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

In [9]:
df_comp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6269 entries, 0 to 6268
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    6269 non-null   datetime64[ns]
 1   spx     6269 non-null   float64
 2   dax     6269 non-null   float64
 3   ftse    6269 non-null   float64
 4   nikkei  6269 non-null   float64
dtypes: datetime64[ns](1), float64(4)
memory usage: 245.0 KB

### Setting the Index

In [10]:
df_comp.set_index('date', inplace= True)

In [11]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Setting the Desired Frequency

In [12]:
# Day frequency
# df_comp = df_comp.asfreq('d')

In [13]:
#df_comp.head()

In [14]:
len(df_comp)

6269

In [15]:
# Just Business-Days 
df_comp = df_comp.asfreq('b')
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [16]:
len(df_comp)

6277

#### from 8789 to  6277 days !!!

### Handling Missing Values

In [17]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [18]:
# Imputaion with fillna method
df_comp.spx = df_comp.spx.fillna('ffill')
df_comp.isnull().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [19]:
df_comp.ftse = df_comp.ftse.fillna('bfill')
df_comp.isnull().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [20]:
df_comp.dax = df_comp.dax.fillna(value = df_comp.dax.mean())
df_comp.isnull().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

### Extend From another resource [impute with interpolate method] # Linear->Forward

In [21]:
df_comp.nikkei = df_comp.nikkei.interpolate(method='linear', limit_direction='forward')
df_comp.isnull().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

### Simplifying the Dataset

In [22]:
# Work only with spx
df_comp['market_value'] = df_comp.spx

In [23]:
df_comp.describe()

                dax        nikkei
count   6277.000000   6277.000000
mean    6080.063363  14597.634966
std     2752.604984   4043.737425
min     1911.700000   7054.980000
25%     4070.460000  10701.130000
50%     5774.380000  15030.510000
75%     7442.660000  17860.470000
max    13559.600000  24124.150000

In [24]:
del df_comp['spx'], df_comp['dax'], df_comp['ftse'], df_comp['nikkei']

In [28]:
df_comp.head()

           market_value
date
1994-01-07        469.9
1994-01-10       475.27
1994-01-11       474.13
1994-01-12       474.17
1994-01-13       472.47

### Splitting the Data

In [30]:
size = int(len(df_comp)*0.8)

In [31]:
df_train = df_comp.iloc[:size]

In [34]:
df_test = df_comp.iloc[size:]

In [36]:
df_train.shape, df_test.shape

((5021, 1), (1256, 1))

In [37]:
df_train.tail()

           market_value
date
2013-04-01  1562.173837
2013-04-02  1570.252238
2013-04-03  1553.686978
2013-04-04  1559.979316
2013-04-05   1553.27893

In [38]:
df_test.head()

           market_value
date
2013-04-08  1563.071269
2013-04-09  1568.607909
2013-04-10  1587.731827
2013-04-11  1593.369863
2013-04-12  1588.854623